    
    //26本书 两本（知根鸟女孩和知乎周刊第二个标注）无内容 共十本书名
    var sourcestring=`哈利波特原版（全集） (J·K·罗琳 （J.K.Rowling）)- 您在位置 #5739-5740的标注 | 添加于 2016年11月21日星期一 上午12:19:25Nearly Headless Nick tried vainly to recapture his audience, but gave up as Sir Patrick’s head went sail-ing past him to loud cheers.==========`+
    `指数基金投资指南（雪球【岛】系列） (雪球「岛」系列) (银行螺丝钉)- 您在位置 #429-430的标注 | 添加于 2016年10月11日星期二 下午7:54:20·方法三：申万历史数据 通过这个网址下载：http://www.swsindex.com/idx0510.aspx。可以结合Excel或者MATLAB做一些简单的历史数据分析。==========`+
    `知更鸟女孩 ([美] 查克·温迪格)- Your Highlight on Location 2619-2625 | Added on Tuesday, February 21, 2017 1:11:53 AM==========`+ //无内容
    `技术元素 (凯文·凯利)- 您在位置 #392-392的标注 | 添加于 2015年4月23日星期四 上午9:25:22目光聚集的地方，金钱必将跟随==========`+
    `技术元素 (凯文·凯利)- 您在位置 #436-437的标注 | 添加于 2015年4月23日星期四 上午9:44:33生命，无论大小，其独特之处部分在于它能传承过去，在当下表现过去，==========`+
    `暗时间 (刘未鹏)- 您在位置 #1820-1822的标注 | 添加于 2016年5月12日星期四 下午12:06:07结果如果要你一开口说给别人听，常常会发现事情就开始变得不那么明显了，你说着说着，就开始莫名其妙地发现自己需要用到“反正”这个词了。==========`+
    `最璀璨的银河——刘慈欣经典作品集 (刘慈欣)- Your Highlight on Location 242-242 | Added on Thursday, May 12, 2016 4:43:12 PM我把双手==========`+
    `最璀璨的银河——刘慈欣经典作品集 (刘慈欣)- Your Note on Location 243-243 | Added on Thursday, May 12, 2016 4:43:24 PMnote==========`+
    `最璀璨的银河——刘慈欣经典作品集 (刘慈欣)- Your Highlight on Location 243-243 | Added on Thursday, May 12, 2016 4:43:24 PM微风中==========`+
    `古董局中局大全集 (马伯庸)- 您在位置 #3522-3523的标注 | 添加于 2016年4月12日星期二 下午4:03:21我告诉你们，正经和尚是不会算命的。佛门经典一万三千六百卷里，没一句教人求神问卜==========`+
    `The Martian (Andy Weir)- 您在位置 #3418-3418的标注 | 添加于 2016年4月17日星期日 上午12:43:23Things will just be harder than planned.==========`+
    `把生命浪费在美好的事物上 (吴晓波)- 您在位置 #240-248的标注 | 添加于 2016年4月18日星期一 下午7:43:37近年来，还突然喜欢看建筑师、设计师的文字，因为我觉得他们的实用感是我们这些做文章的人需要学习的，房子是建来让人住的，服装是裁剪出让人穿的，所以，合体舒服是第一要义。做文章是让人读的，也应该这样。山本耀司是我非常喜欢的日本服装设计师，他很喜欢从老照片中吸取灵感，他说自己有很多世纪初人像摄影的图书，喜欢那里面人与衣服之间的关系，人们穿的不是时尚，而是现实（reality）。或者换句话说，山本耀司希望他设计的服饰能够给穿它们的人这种感觉。我想，这是一种人们能够通过自己的穿着认识自己的感觉，当你照镜子的时候，你看到的是自己，而非衣服或时尚。 这样的体悟又岂仅与服装有关。大抵造园、作画、裁衣、行文、做企业、为人，天下一理，若胸中格局足够，无论大小都不足惧，关键是大处能容天地，小处能觅细针，须控制事物发展的节奏。所谓经验两字，经是经过的事，验是得到印证的事，都与实际有关。==========`+
    `The Martian (Andy Weir)- 您在位置 #4020-4020的标注 | 添加于 2016年4月24日星期日 下午6:37:44Plan for the worst.==========`+
    `The Martian (Andy Weir)- 您在位置 #4692-4692的标注 | 添加于 2016年5月2日星期一 上午12:20:06So right now, I have a few problems to tackle: First,==========`+
    `把生命浪费在美好的事物上 (吴晓波)- 您在位置 #297-303的标注 | 添加于 2016年5月2日星期一 上午1:24:12这个天才横溢的家伙著述等身，但被翻译到中国的却只有一本薄薄的《公众舆论》，这是他32岁时的作品。在这本册子中，他论证了“公众舆论”的脆弱、摇摆和不可信任。他指出，现代社会的复杂和规模使得一般人难以对它有清楚的把握。现代人一般从事某种单一的工作，整天忙于生计，既没有时间也没有心思去深度关切他们的生活世界。他们很少认真涉入公众事务讨论。他们遇事往往凭印象、凭成见、凭常识来形成意见。正因如此，社会需要传媒和一些精英分子来梳理时政，来抵抗政治力量对公众盲视。这些声音听起来由陌生而熟悉，渐渐地越来越刺耳，现在我把它抄录在这里，简直听得到思想厉鬼般的尖叫声。==========`+
    `把生命浪费在美好的事物上 (吴晓波)- 您在位置 #366-367的标注 | 添加于 2016年5月2日星期一 下午3:08:36我们的书单决定了我们的过去，同时也指向一个辽阔的未来。==========`+
    `魔鬼经济学：揭示隐藏在表象之下的真实世界 ([美]史蒂芬·列维特、史蒂芬·都伯纳)- 您在位置 #24-25的标注 | 添加于 2016年6月5日星期日 下午11:45:07伦理道德代表了我们心目中理想的社会运行模式的话，那么经济学就是在向==========`+
    `魔鬼经济学：揭示隐藏在表象之下的真实世界 ([美]史蒂芬·列维特、史蒂芬·都伯纳)- 您在位置 #24-25的标注 | 添加于 2016年6月5日星期日 下午11:45:21如果说伦理道德代表了我们心目中理想的社会运行模式的话，那么经济学就是在向我们描述这个社会到底是如何运行的。==========`+
    `魔鬼经济学：揭示隐藏在表象之下的真实世界 ([美]史蒂芬·列维特、史蒂芬·都伯纳)- 您在位置 #47-47的标注 | 添加于 2016年6月5日星期日 下午11:54:11本书让你从一种最为有趣的角度理解我们周围的世界；一定会让你大开眼界！==========`+
    `指数基金投资指南（雪球【岛】系列） (雪球「岛」系列) (银行螺丝钉)- 您在位置 #826-829的标注 | 添加于 2016年10月11日星期二 下午10:58:14当指数基金下跌的时候，正是指数基金的盈利收益率上涨的时候。从盈利收益率的角度，指数基金下跌得越多，盈利收益率上涨得就越多。我们可以用更低的价格，买到盈利收益率更高的指数基金，未来的长期收益会更好，认识到了这一点，我们就不会再讨厌下跌了。==========`+
    `指数基金投资指南（雪球【岛】系列） (雪球「岛」系列) (银行螺丝钉)- 您在位置 #830-831的标注 | 添加于 2016年10月11日星期二 下午10:59:21西格尔教授在《股市长线法宝》==========`+
    `知乎周刊 Plus・重拾英语听说：如何通过持续学习提升你的英语（总第 011 期） (知乎)- 您在位置 #202-203的标注 | 添加于 2016年10月11日星期二 下午11:30:52理解技能（听、读）和产出技能（说、写）是两个不同的通道。==========`+
    `知乎周刊 Plus・重拾英语听说：如何通过持续学习提升你的英语（总第 011 期） (知乎)- 您在位置 #249-249 的书签 | 添加于 2016年10月11日星期二 下午11:43:01==========`+//无内容
    `知乎周刊 Plus・重拾英语听说：如何通过持续学习提升你的英语（总第 011 期） (知乎)- 您在位置 #253-255的标注 | 添加于 2016年10月11日星期二 下午11:43:10如果你的目的真的是要学英语，你需要做的是选择一个比较贴近生活的（比如《摩登家庭》《老爸老妈罗曼史》，或者《老友记》），比较符合你个人英语水平的，或许更重要的是你真正喜欢的感兴趣的剧/秀，然后开始一遍一遍反反复复地刷。==========`+
    `知乎周刊 Plus・重拾英语听说：如何通过持续学习提升你的英语（总第 011 期） (知乎)- 您在位置 #255-262的标注 | 添加于 2016年10月11日星期二 下午11:43:25最起码每一集刷 10 遍吧，基础不好的需要刷更多次。第一遍可以看剧情和中文字幕，第二遍看英文字幕，不会的词和表达赶快查查。第三遍之后用听的就可以了。听到什么程度？基本上人家说上一句你能接下一句就差不多了。如果不嫌累的话，自己跟着剧中角色读也挺好。比如走在路上就可以跟着读，我曾经就是这样做的，缺点是会被不少人骂。如果嫌总是听一集乏味，那也可以一集听 2～3 遍换下一集，听个 3～4 遍然后再换回来听之前那一集。不要一季一季地听，不然又在关注剧情了。如果发现听了几遍还是没怎么懂，那就再跟着中英字幕看几次。如果你最后需要听 30 次才能达到效果，那就听 30 次甚至更多。关键是，宁愿你听 100 遍然后把这一集完完全全背下来，也不要去听 100 集然后发现自己就知道谁睡了谁，谁又和谁出轨了，最后超人拯救了地球却救不了你。==========`+
    `知乎周刊 Plus・重拾英语听说：如何通过持续学习提升你的英语（总第 011 期） (知乎)- 您在位置 #262-264的标注 | 添加于 2016年10月11日星期二 下午11:43:29你可能会好奇为什么我都是用听这个动词。因为看的话，难免会把注意力集中在宏大的视觉效果，男孩的十六块腹肌啊，女孩 1 米 8 的大长腿啊等等。而只听的话，你就能摒弃其他所有的诱惑，完全关注在他们的语言上了。==========`